In [3]:
import pandas as pd

## Import data

In [4]:
item_to_id = pd.read_csv("item_to_id.csv")
purchase_history = pd.read_csv("purchase_history.csv")

In [5]:
item_to_id.head()

         Item_name  Item_id
0           coffee       43
1              tea       23
2            juice       38
3             soda        9
4  sandwich loaves       39

In [6]:
purchase_history.head()

   user_id                                                 id
0   222087                                              27,26
1  1343649                                            6,47,17
2   404134                       18,12,23,22,27,43,38,20,35,1
3  1110200                                 9,23,2,20,26,47,37
4   224107  31,18,5,13,1,21,48,16,26,2,44,32,20,37,42,35,4...

## Data Processing

In [5]:
def id_to_list(df):
    
    item_list = df['id'].str.split(",").sum()
    for item in item_list:
        print(item)

In [6]:
#id_to_list(purchase_history[])

In [14]:
item = purchase_history.id[:2].str.split(",").sum()

In [17]:
item

['27', '26', '6', '47', '17']

In [8]:
purchase_history.id[:10]

0                                                27,26
1                                              6,47,17
2                         18,12,23,22,27,43,38,20,35,1
3                                   9,23,2,20,26,47,37
4    31,18,5,13,1,21,48,16,26,2,44,32,20,37,42,35,4...
5                                     43,29,8,37,23,45
6                            18,15,31,11,20,32,25,6,47
7                       14,43,6,20,7,42,41,28,10,22,46
8                               1,43,31,37,25,32,28,35
9                              27,1,3,2,11,45,10,44,15
Name: id, dtype: object

In [10]:
id_list = [0 for i in range(1, 49)]

In [11]:
id_list

[0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0]

In [12]:
i = 1
id_list[int(i) - 1] += 1

In [13]:
id_list

[1,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0]